public/Simplaa Test Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Simplaa Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">5</intProp>
        <intProp name="ThreadGroup.ramp_time">30</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">startnextloop</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="passenger_get_bonus_list" enabled="true">
          <stringProp name="HTTPSampler.domain">dev.simplaa.app</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/passengerapi114/index/?type=passenger_bonus_list&amp;lang=en&amp;operating_zone=4</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">IpSpgXhunRbV8JfzYIzjr2l1GljbJEXGR0MH+HaOfoxCd/mZ3y7Vw8dWFuGn2VqC</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="get_trip_detail" enabled="true">
          <stringProp name="HTTPSampler.domain">dev.simplaa.app</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/passengerapi114/index/?type=get_trip_detail&amp;lang=en&amp;operating_zone=4</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">49gADbe7zu2erR8+CVpy7wvCEYJm5d21O3Ki2NTGN+sTgdK20K/eOKbtMDQkob+y2taAGUZWFn6AWhRoBiavpQ==</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="passenger_logout_validUser" enabled="true">
          <stringProp name="HTTPSampler.domain">dev.simplaa.app</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/passengerapi114/index/?lang=en&amp;type=passenger_logout&amp;lang=en&amp;operating_zone=4</stringProp>
          <boolProp name="HTTPSampler.auto_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
          <boolProp name="HTTPSampler.BROWSER_COMPATIBLE_MULTIPART">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">vf3e2pJfI0ift1XpjizRFA==</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="passenger_logout_invalidUser" enabled="true">
          <stringProp name="HTTPSampler.domain">dev.simplaa.app</stringProp>
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?lang=en&amp;type=passenger_logout&amp;lang=en&amp;operating_zone=4</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">TGT6BCt0WNAaoSc+Py44uA==</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="check_valid_promocode_expired" enabled="true">
          <stringProp name="HTTPSampler.domain">dev.simplaa.app</stringProp>
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/=?type=check_valid_promocode&amp;lang=en&amp;dt=a&amp;i=1132&amp;pv=89&amp;k=0&amp;s=0&amp;operating_zone=1</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">IpSpgXhunRbV8JfzYIzjr/x8gsJGDaIdEDyCLJfJjeSI8UcN0fVgJ8ijmkY8Q3K0Vs2ClGML6ZeI3Ck7ZS5ArLIyl/MKyRUKgpDqO9wTtBs=</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="check_valid_promocode_Invalid" enabled="true">
          <stringProp name="HTTPSampler.domain">dev.simplaa.app</stringProp>
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/=?type=check_valid_promocode&amp;lang=en&amp;dt=a&amp;i=1132&amp;pv=89&amp;k=0&amp;s=0&amp;operating_zone=1</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">IpSpgXhunRbV8JfzYIzjr/x8gsJGDaIdEDyCLJfJjeSQwLc4j1ssyshkFBA1/MZlvcsGA1PO9xKNupuD4g3nggCTry0w8U9S0Eg42KqwFOI=</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="check_valid_promocode_valid_NA" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/=?type=check_valid_promocode&amp;lang=en&amp;dt=a&amp;i=1132&amp;pv=89&amp;k=0&amp;s=0&amp;operating_zone=1</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="verify_airport_locations_NotFound" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?type=verify_airport_locations&amp;lang=en&amp;operating_zone=5</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">yZVB4KyaMhHcD1RJlvW8LIpzqkn825ylBW9+VdMNNFruQPLr2fcOUq22F8TYkbgWi58DUYznFW18Co+EN9CYVqDu1JKwuw6cr95BZwGidjb5TQ74JtGDaS9vGN9dbuTHOiupXwOotSyjqlRppCkzHw==</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="passenger_create_ride_booking_NA" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?type=savebooking&amp;lang=en&amp;operating_zone=4&amp;dt=a&amp;i=1662&amp;pv=89</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="passenger_profile_Valid" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?lang=en&amp;type=passenger_profile&amp;lang=en&amp;operating_zone=4</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">kgWRxSLCMmGDjPJeWeYABGNURdMtP2nA5zGyuiD58fE=</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="passenger_profile_Invalid" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?lang=en&amp;type=passenger_profile&amp;lang=en&amp;operating_zone=4</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">+txkRnrET+sxIcsJ/tC0+FaIQi+5Evna0dyKdc+hstw=&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="edit_passenger_profile_IncorrectPassword" enabled="true">
          <stringProp name="HTTPSampler.domain">dev.simplaa.app</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">passengerapi114/index/?type=edit_passenger_profile_v1&amp;lang=en&amp;operating_zone=4</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">PUT</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">IpSpgXhunRbV8JfzYIzjrwqotAqkEbE6vZV4A4N8eA66RVUaDxSJNOcumeNluvQWxs1feHhx4V8LGdSSwwvxQ2edBQV8owCYHVDUdftmRk/VfUDtQrHYQ+LvKfMcvTU01LfCHmx5d9wU/mpjBmWPcNZSkROVqO3vHb7P1F0pa1+uxKo7Sa51eawq2yJarqRmFcR44yVAPkqwEK6TwnEP59/4QY4AVtswWI6QlRAgHNU=</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="edit_passenger_profile_CorrectPassword_NA" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?type=edit_passenger_profile_v1&amp;lang=en&amp;operating_zone=4</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">PUT</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="cancel_trip_NA" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?type=cancel_trip&amp;lang=en&amp;operating_zone=4</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="passenger_mobile_check_NA" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?type=passenger_mobile_check&amp;lang=en&amp;operating_zone=4</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="passenger_wallet_info_valid" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?type=passenger_wallet&amp;lang=en&amp;operating_zone=5</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">IpSpgXhunRbV8JfzYIzjryhJicbgD0VT/UaLvjjINW9mOyhakrded40G6TGrOr7R</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="create_transaction_passanger_peer2peer" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?type=create_transaction&amp;lang=en&amp;operating_zone=2</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="transactions_list_NA" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?type=create_transaction&amp;lang=en&amp;operating_zone=2</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="passenger_login_to be reviewed" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?type=passenger_login&amp;lang=en&amp;operating_zone=4</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">8wVfJfMLZHY3UXNttU7HAognr36/T2XrWFcNNV+MzXcIeoqHsSCAmcfqeVaDDQFSiHL/QRcKZuXXgKgxjMcUkwUXwTyUfOUpTzyOATRIg9nq64sjBowPHkLZGVQEW8I6DdEXKsD6KHe9EWZULyuwJPbNNqY0530nDErf3afT0Y93fRlc+fMxN3NaHGArGe1iyl5Fvte+xXZtj2RAdN1CMGIUnpjucS8paQUBTwLuhCaOEKIZBroaIzAmT1Wq2htLsw+lfzhGNXZI72l/I9Sl3k1e2XjCsp64FncGloxQTMKc4tjNejIZXUxcoWGoPKFt0DlZ7N4GuaiBUjbmRyTMVZ5nmQA2GWqV4Koe6AUjGWzOb+Jeu6PL/ow1Em7PtkydczH3ra/6zhRFYGQLmWVa/A==</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="forgot_password_registered user" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?type=forgot_password&amp;lang=en&amp;operating_zone=8</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">FRya9Y/e+ZOuJwctCvLmlTWM3OnfGwUiOzwRQOe4qQYXct/uqV74g2lsLW78xSTS6C9xv8kvW3jE0EwDSHjsYNWI/kfslOzUdo9APWVPP2gl9XWEo0mmNtboqHz+H8uS</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="forgot_password_unregistered user" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?type=forgot_password&amp;lang=en&amp;operating_zone=8</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">4Qd0nnf6Pywg4U+5h0KRknifxiSYrpL0EG3eJLmbNbBJMk0VcaZf7mP34lJbzvtHkM3a2hmGxDGJ/uxDaybaJu3xCMFyGwUSQUngCDnTRrUcWnv2Ai371/rd4dEsJm5l</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="get_passenger_trip_update_No trip" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?type=getpassenger_update&amp;lang=en&amp;operating_zone=5</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">vzOTjO4Md6CmFcPHd0f53hoc4ZjLobB6sjJ/laYb6lYbJc6RYkMGgZ1Ns3Ry+5noZsadAM8GZIk2TWykw2SWlobWKVAcl9ftYGxiNfD8C5JFBoraAHbDK3TZH4iaPcmz</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="get_passenger_trip_update_Valid NA" enabled="true">
          <stringProp name="HTTPSampler.path">https://dev.simplaa.app/passengerapi114/index/?type=getpassenger_update&amp;lang=en&amp;operating_zone=5</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">vzOTjO4Md6CmFcPHd0f53hoc4ZjLobB6sjJ/laYb6lYbJc6RYkMGgZ1Ns3Ry+5noZsadAM8GZIk2TWykw2SWlobWKVAcl9ftYGxiNfD8C5JFBoraAHbDK3TZH4iaPcmz</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="nearest_driver_list" enabled="true">
          <stringProp name="HTTPSampler.domain">18.134.147.218</stringProp>
          <stringProp name="HTTPSampler.port">3345</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/nearestdriver_list?lang=en&amp;pv=90&amp;i=2137&amp;lang=en&amp;dt=a</stringProp>
          <boolProp name="HTTPSampler.auto_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
          <boolProp name="HTTPSampler.BROWSER_COMPATIBLE_MULTIPART">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">irFxfvBj6tXNW4euG69lDgz6rE7Es3TgImh2HOBkbQ2+q35ejWFB66pB0vHy3j7FulcyLuOQEdI7V+oypjwS5yfXD1/VPDdcoK2rzi1oHPEiEDSF7yPKbRw9wxLG/XFWS/UkZm+7DyXj2j8DPCs4P8HKIOKqMLVk7+JuujKbLFNdZSjl9RwIk2ut8lFTAqmiqiUczPDtFU24YS5F1KlNDe6utbpu2CRYxz/Aphcv9/+M8CMEwRENmPd8Zza0Bmj+VAVfxQWJM0/pV1C0xPIZStY/cDYq9LZIbVEsNECkfhUQGgU2nu9wXYL0HXTd60xcPyh+Bi/ZSrxtCfT1qUWKfLZ0Z6Nbja9G8PDFs9+uR/QzdKYKQXA794y03oa2ev5U2RxpKYjFlFELeimmWaKdRiyVBOaQXo1N2N07JwWTO/KrDFoVBIO0751177TrRdmq7nfWUDfcuKvWjRWUxpVh7AHdjFPHqFTZHZ6DDms5f3pad/40Un60wIrajFPKQwL5BCfB0IdPw6urIVXG+fh+s2k7fSkTwxMM1t0BrIOTuNJoJkqvZ1hKoc/OeQXyZa6E3C5VLKAbNfjBIlrBoXSN8zPg8sXskw9hHpufiNVZjBw8ZIIT2OlKfyRZpyA1TApZf9NBrkovlgsBQU9xuA46OTm/ey7+25Q4GHnr9dD4qfj31ZgRaqhEssOLni7ZGAP3</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">content-type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">accept</stringProp>
              <stringProp name="Header.value">*/* </stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">content-type</stringProp>
              <stringProp name="Header.value">text/plain</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>